{
    "id": "jeff",
    "title": "'Godfather of AI' Geoffrey Hinton quits Google to speak out on technology's dangers",
    "content": "AI pioneer quits Google to warn about the technology’s ‘dangers’\n\nBy Jennifer Korn\n\nUpdated 6:15 AM EDT, Wed May 3, 2023\n\n\n\n\n\n\n\n\n\nnightcap chatbot 16x9\n\nExpert warns new AI chatbot could lead to 'nightmare scenario'\n\n02:52\n\nBaidu\n\nChinese companies are hiring AI-employees\n\n05:14\n\nLONDON, ENGLAND - FEBRUARY 11: EDITORIAL USE ONLY David Guetta performs on stage during The BRIT Awards 2023 at The O2 Arena on February 11, 2023 in London, England. (Photo by Gareth Cattermole/Getty Images)\n\nHe's sold over 50m records and now he's using AI to create music\n\n02:51\n\nearly chat bot 2002 vault 01\n\nLong before ChatGPT, these online chat bots were already talking to humans\n\n01:53\n\nGeoffrey Hinton the lead 0502\n\n'Godfather of AI' says AI could kill humans and there might be no way to stop it\n\n01:18\n\nJon Sarlin Amanda Steen 1\n\nCNN tried an AI flirt app. It was shockingly pervy\n\n03:19\n\nDonie AI voice thumb 1\n\nCNN reporter calls his parents using AI voice. Watch what happens next\n\n05:47\n\nHouse of News en Espanol FAKE AI 01\n\nThese 'news anchors' are created by AI and they're spreading misinformation in Venezuela\n\n03:29\n\nPope Francis arrives to lead his weekly general audience in the Paul VI hall at the Vatican on October 21, 2020. (Photo by VINCENZO PINTO / AFP) (Photo by VINCENZO PINTO/AFP via Getty Images)\n\nTech expert weighs in on viral AI-generated photo of the Pope\n\n03:28\n\nnightcap 012623 Clip 2 16x9 nb\n\nHear why this teacher says schools should embrace ChatGPT, not ban it\n\n01:29\n\nYusuf Mehdi, Microsoft Corporate Vice President of Modern Life, Search, and Devices, speaks during a keynote address announcing ChatGPT integration for Bing at Microsoft in Redmond, Washington, on February 7, 2023. - Microsoft's long-struggling Bing search engine will integrate the powerful capabilities of language-based artificial intelligence, CEO Satya Nadella said, declaring what he called a new era for online search. (Photo by Jason Redmond / AFP) (Photo by JASON REDMOND/AFP via Getty Images)\n\nSee what it's like to use Bing's new AI search feature\n\n02:09\n\nscott galloway vpx\n\nScott Galloway on the 'scarier part' of AI tools like ChatGPT\n\n02:07\n\nexp ChatGPT AI schlomo dovrat FST 031504PSEG1 cnni business_00010314.png\n\nDovrat: ChatGPT will change the way we do business\n\n03:11\n\nKevin Roose NYT tech journalist\n\nJournalist says he had a creepy encounter with new tech that left him unable to sleep\n\n03:28\n\nOpenAI ChatGPT STOCK\n\nHe loves artificial intelligence. Hear why he is issuing a warning about ChatGPT\n\n04:38\n\neric schmidt daniel huttenlocher artifical intelligence ethics\n\nEric Schmidt: AI is not ready to make profound decisions\n\n04:49\n\nnightcap chatbot 16x9\n\nExpert warns new AI chatbot could lead to 'nightmare scenario'\n\n02:52\n\nBaidu\n\nChinese companies are hiring AI-employees\n\n05:14\n\nLONDON, ENGLAND - FEBRUARY 11: EDITORIAL USE ONLY David Guetta performs on stage during The BRIT Awards 2023 at The O2 Arena on February 11, 2023 in London, England. (Photo by Gareth Cattermole/Getty Images)\n\nHe's sold over 50m records and now he's using AI to create music\n\n02:51\n\nearly chat bot 2002 vault 01\n\nLong before ChatGPT, these online chat bots were already talking to humans\n\n01:53\n\nGeoffrey Hinton the lead 0502\n\n'Godfather of AI' says AI could kill humans and there might be no way to stop it\n\n01:18\n\nJon Sarlin Amanda Steen 1\n\nCNN tried an AI flirt app. It was shockingly pervy\n\n03:19\n\nDonie AI voice thumb 1\n\nCNN reporter calls his parents using AI voice. Watch what happens next\n\n05:47\n\nHouse of News en Espanol FAKE AI 01\n\nThese 'news anchors' are created by AI and they're spreading misinformation in Venezuela\n\n03:29\n\nNew York\n\nCNN\n\n — \n\nGeoffrey Hinton, who has been called the ‘Godfather of AI,’ confirmed Monday that he left his role at Google last week to speak out about the “dangers” of the technology he helped to develop.\n\n\n\nGeoffrey Hinton speaks during The International Economic Forum of the Americas Toronto Global Forum in Toronto, Canada, in 2019. \n\nGeoffrey Hinton speaks during The International Economic Forum of the Americas Toronto Global Forum in Toronto, Canada, in 2019.\n\nHinton’s pioneering work on neural networks shaped artificial intelligence systems powering many of today’s products. He worked part-time at Google for a decade on the tech giant’s AI development efforts, but he has since come to have concerns about the technology and his role in advancing it.\n\n\n\n“I console myself with the normal excuse: If I hadn’t done it, somebody else would have,” Hinton told the New York Times, which was first to report his decision.\n\n\n\nIn a tweet Monday, Hinton said he left Google so he could speak freely about the risks of AI, rather than because of a desire to criticize Google specifically.\n\n\n\n“I left so that I could talk about the dangers of AI without considering how this impacts Google,” Hinton said in a tweet. “Google has acted very responsibly.”\n\n\n\nJeff Dean, chief scientist at Google, said Hinton “has made foundational breakthroughs in AI” and expressed appreciation for Hinton’s “decade of contributions at Google.”\n\n\n\n“We remain committed to a responsible approach to AI,” Dean said in a statement provided to CNN. “We’re continually learning to understand emerging risks while also innovating boldly.”\n\n\n\nHinton’s decision to step back from the company and speak out on the technology comes as a growing number of lawmakers, advocacy groups and tech insiders have raised alarms about the potential for a new crop of AI-powered chatbots to spread misinformation and displace jobs.\n\n\n\nThe wave of attention around ChatGPT late last year helped renew an arms race among tech companies to develop and deploy similar AI tools in their products. OpenAI, Microsoft and Google are at the forefront of this trend, but IBM, Amazon, Baidu and Tencent are working on similar technologies.\n\n\n\n\n\n'The Godfather of AI' quits Google and warns of its dangers. Apple co-founder weighs in\n\n02:44 - Source: CNN\n\nIn March, some prominent figures in tech signed a letter calling for artificial intelligence labs to stop the training of the most powerful AI systems for at least six months, citing “profound risks to society and humanity.” The letter, published by the Future of Life Institute, a nonprofit backed by Elon Musk,came just two weeks after OpenAI announced GPT-4, an even more powerful version of the technology that powers ChatGPT. In early tests and a company demo, GPT-4 was used to draft lawsuits, pass standardized exams and build a working website from a hand-drawn sketch.\n\n\n\nIn the interview with the Times, Hinton echoed concerns about AI’s potential to eliminate jobs and create a world where many will “not be able to know what is true anymore.” He also pointed to the stunning pace of advancement, far beyond what he and others had anticipated.\n\n\n\n“The idea that this stuff could actually get smarter than people — a few people believed that,” Hinton said in the interview. “But most people thought it was way off. And I thought it was way off. I thought it was 30 to 50 years or even longer away. Obviously, I no longer think that.”\n\n\n\nEven before stepping aside from Google, Hinton had spoken publicly about AI’s potential to do harm as well as good.\n\n\n\n“I believe that the rapid progress of AI is going to transform society in ways we do not fully understand and not all of the effects are going to be good,” Hinton said in a 2021 commencement address at the Indian Institute of Technology Bombay in Mumbai. He noted how AI will boost healthcare while also creating opportunities for lethal autonomous weapons. “I find this prospect much more immediate and much more terrifying than the prospect of robots taking over, which I think is a very long way off.”\n\n\n\nHinton isn’t the first Google employee to raise a red flag on AI. In July, the company fired an engineer who claimed an unreleased AI system had become sentient, saying he violated employment and data security policies. Many in the AI community pushed back strongly on the engineer’s assertion.\n\n\n\nCNN’s Samantha Murphy Kelly and Ramishah Maruf contributed to this report.",
    "summary": "Geoffrey Hinton, a pioneer in AI and credited as the 'Godfather of AI', left his role at Google last week to speak about the 'dangers' of the technology. Hinton, whose pioneering work on neural networks has shaped many of today’s AI systems, came to have concerns about the technology and his role in advancing it. His decision to step back from the company and speak out on the technology comes as a growing number of lawmakers, advocacy groups and tech insiders have raised alarms about the potential for a new crop of AI-powered chatbots to spread misinformation and displace jobs.",
    "children": []
}