{
    "id": "multid_hai",
    "title": "Exploring the Synergy between Human Creativity and AI through a Multidisciplinary Approach",
    "content": "Content is too long and is chunked into 2 child nodes.",
    "summary": "This document investigates the relationship between human creativity and AI through a multidisciplinary approach, specifically by conducting experiments to gain insights into how human-AI co-creativity can support and enhance creative approaches to different types of challenges. The paper explores the potential of AI assisting and augmenting human creativity in creative tasks and how human-AI co-creativity can be leveraged to support and enhance creative task-solving. It includes a co-creative theatre project, developing an interactive prototype for digitized photo products, and two focus groups to explore participants' familiarity with co-creative systems and their interest in collaborating with them. The document provides insights into co-creative human-AI synergies and yielding guidelines that provide ethical approaches to this topic.",
    "children": [
        {
            "id": "multid_hai.chunk_1",
            "title": "A Multidisciplinary Approach of Exploring Human Creativity and AI Synergy",
            "content": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52A Multidisciplinary Approach of Exploring the Synergy of Human Creativity and Artificial Intelligence ANI WITHÖFT, OFFIS - Institute for Information Technology, Oldenburg, Germany Recent advances in artificial intelligence (AI), and generative models in particular, are opening up new discussions about the types of tasks humans should focus on in the future and the role of creativity in human-AI collaboration. In this paper, I propose to investigate the mechanisms underlying the synergy between human creativity and AI through a multidisciplinary approach. By conducting several experiments in which human participants interact with AI systems to cooperatively solve creative tasks in, for instance, the fields of theater, photography, web design, or art, insights will be gained into how human-AI co-creativity can support and enhance creative approaches to different types of challenges. This work reports on ongoing research and future steps. My research intends to contribute to a deeper understanding of the potential of human-AI co-creativity and how it can positively foster human-AI collaboration. CCS Concepts: •Human-centered computing →Empirical studies in HCI ;User studies ;Collaborative interaction . Additional Key Words and Phrases: Generative Artificial Intelligence, Human-AI Collaboration, Human Creativity Support and Augmentation, Human-AI Co-Creativity ACM Reference Format: Ani Withöft. 2023. A Multidisciplinary Approach of Exploring the Synergy of Human Creativity and Artificial Intelligence. In CHI ’23: Workshop on Generative AI and HCI, April 23–285, Hamburg, Germany. ACM, New York, NY, USA, 6 pages. https://doi.org/XXXXXXX. XXXXXXX 1 INTRODUCTION Artificial intelligence (AI) has made significant strides in machine learning, deep learning, and generative approaches in recent years. This progress has major societal impacts and is shifting the way we work and learn. Technological advances bring many benefits, yet we still face the challenge of not knowing how to use new technologies. Thus, I argue that it is crucial to focus on human empowerment, for example, by focusing on human creativity and exploring how to design collaborative systems that enhance human capabilities rather than replace them. In research, there has been growing interest in the human-AI co-creativity field [ 4,10–12]. In this context, co-creativity refers to the collaborative process between computers and humans to produce shared creative artifacts [ 7]. In this work, I propose to investigate the mechanisms underlying the synergy between humans and AI in the area of creativity and the contributing factors. Developments in AI, such as human-computer collaborations [ 18,23,24], mixed initiative systems [ 20,25], and the field of AI art [ 5,9,26] have opened up new possibilities for co-creative interactions between humans and AI. The emerging areas show the need for a more dynamic and flexible form of interaction where humans and AI can work together seamlessly and naturally. However, despite this potential, there is a lack of understanding the fundamental dynamics and factors that contribute to collaborative partnerships between humans and AI systems. Researchers anticipate that AI will be used extensively as a tool that assists collaborative creativity and interactivity in the near future [ 1], making AI systems play an increasingly important role in creative fields, for instance in art [ 5]. Ultimately, Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. ©2023 Association for Computing Machinery. Manuscript submitted to ACM 153 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104CHI’23, April 23–28, 2023, Hamburg, Germany Ani Withöft this will reverse the traditional roles and humans and computers, with the human solely dictating and the computer supporting [6]. A key argument for investigating human-AI co-creativity is the potential for AI to assist and augment, rather than replace human creativity in creative tasks [ 1,4]. Creativity is a concept that is connected to subjective ideas and perceptions and thus enables innovation [ 17]. Generative AI models are able to generate novel and unique content, but may not be able to provide all capabilities to mimic the entire range of human creativity [ 1]. I, along with other researchers [ 8], believe that there is a lack in exploring the interaction techniques of generative AI models and applications that support co-creativity through human-centered design steps. Thus, my research intends to address this research gap. Given the need for user studies in this area [ 11], I plan to conduct a series of multidisciplinary experiments in which human participants interact with AI systems of creative environments. By examining the outcomes of these co-creative processes, I aim to gain a better understanding of how human-AI co-creativity can be leveraged to support and enhance creative task-solving. Moreover, I am concerned with the artifact of creativity, which is not necessarily a work of art. Creativity can manifest itself in various (intangible) forms such as new ideas, solutions to problems, or innovative approaches to existing tasks. Curiosity and experimentation often motivate creative endeavors which require combining ideas from different fields or previous experiences in a meaningful yet abstract way [ 1]. Human-AI co-creativity has the potential to enhance the artifact of creativity by offering novel approaches and resources for idea generation and development. But, effective collaboration depends on the AI system’s ability to support the human creative process, and the human’s ability to integrate and utilize the AI’s capabilities. In addition to that, I will explore ethical considerations involved in human-AI co-creativity, since technological progress must be accompanied by a better understanding of ethical concerns, bias, and broader social implications [ 1]. Hence, research on this topic will provide guidelines and best practices for future researchers, software developers, and AI practitioners to ensure responsible AI use. 2 RELATED WORK This section briefly outlines related work in the area of co-creativity between humans and AI. Given that creativity itself is a vast and far-reaching endeavor that cannot be quantified even for humans [ 6], co- creativity subsequently spans across multiple research domains, too. Co-creative music generation [ 19] and exploration [3], human-AI collaborations in live artistic performances [ 23], co-creative sketching tools [ 14,15,21], or co-creative AI for public spaces [ 16] are just a few examples for the broad area. In the field of Human-Computer Interaction (HCI) the current landscape of AI-empowered co-creative tools are outlined in a review by Hwang [ 12]. The author notes that most creativity tools are designed for the later phases of creativity instead of the early stages of creativity [12]. Another emerging field highly relevant to human-AI co-creativity is \"AI art, \" as a growing number of artists incorporate AI into their work. The work of Cetinic and She [ 5] shows a review on AI art which investigates how AI is used to analyze art and applied to digitized artwork collections, and also how AI is used for creative purposes and generation of novel art [ 5]. Practical and theoretical aspects of AI art are outlined, as well as an overview of existing AI art datasets [5]. Further, Grba [ 9] critically examines AI art by addressing its practices within contemporary art, AI research, and related fields. Ways to advance the field are explored, with the author offering new perspectives on the critique of art, science, and technology in a world where they influence values and shape political norms [9]. Moreover, there has been progress in the development of frameworks and tools for analyzing and facilitating co-creation in research. Grabe et al. [ 8], for example, propose a framework to analyze human-GAN collaboration in co-creative GAN applications. The authors define four interaction patterns (Curating, Exploring, Evolving, and 2105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156Synergy of Human Creativity and Artificial Intelligence CHI’23, April 23–28, 2023, Hamburg, Germany Conditioning) for better understanding the affordances and limitations of co-creation [ 8]. The authors note that designing human-AI interaction remains a challenge due to the complex and non-interpretable nature of AI models [8]. Guzdial and Riedl [ 10] present an interaction framework between human users and AI agents designed to support human creativity. The framework provides a system where a human user and AI agent work together in a turn-based fashion to design an artifact [ 10]. Rezwaner and Maher [ 22] demonstrate a framework for modeling interaction in co-creative systems that can serve as a tool for identifying research directions and gaps in the field of co-creativity. The results of [22] show that the scope of capabilities in the field of co-creativity is not fully explored. In summary, the domain of co-creativity between humans and AI requires further research as the design of human-AI interaction is under-explored and remains challenging due to the complex nature of AI models [ 8,10]. There is a scarcity of user-centered studies and designs, as well as systems that incorporate AI to human communication [22]. 3 METHODS This section presents the methodologies employed in the endeavor of this work. Overall, the work follows the human- centered design (HCD) process [ 13]. Thus, the first step is to identify the Context of Use (CoU). To this end, an in-depth literature analysis and two focus groups are foreseen. One focus group (FG) shall be conducted with non-experts, representing people with limited experience with human-AI co-creativity. The second FG is planned for experts, meaning people who use human-AI co-creativity in their daily lives and work. The first FG has already taken place, the results of which are reported in the next Section 4. The aim of the FG is to identify how much knowledge there is about human creativity, human co-creativity, AI creativity and human-AI co-creativity. Discussions on the acceptability of co-creative systems and where people can imagine using such systems in their lives are included. The second step is the Requirement Analysis (RA), for which several steps are foreseen: (1) Conducting user studies to comprehend the design requirements and preferences of possible users (for instance, in form of questionnaires or semi-structured interviews with AI-using artists), (2) Workshops with art enthusiasts, in which participants interact with different versions of AI-assisted systems designed to elicit different types of co-creative interactions, and (3) Analysis of several interactive media processing web apps developed as part of my work project. Based on this RA conclusions will be made and requirements for possible prototypes will be deducted. The third and fourth steps of the HCD process are implementation and evaluation of prototypes. Therefore, par- ticipatory design, a method of involving users in the design process, will be employed to obtain continuous feedback on design decisions. A first practical work in the form of a co-creative project with a state theater is planned and will be staged as a theater installation. This will be evaluated and the feedback will be utilized to improve the prototype. In a second round of implementation, another interactive, co-creative prototype for digitized photo products will be planned and executed. Please note that the possible realizations depend on the results of the previous analysis, due to which deviations may occur.",
            "summary": "This document discusses the investigation of the synergy between human creativity and AI through a multidisciplinary approach. By conducting several experiments in which human participants cooperatively solve creative tasks with AI systems, insights will be gained into how human-AI co-creativity can support and enhance creative approaches to different types of challenges. The paper explores the potential of AI assisting and augmenting human creativity in creative tasks and how human-AI co-creativity can be leveraged to support and enhance creative task-solving.",
            "children": []
        },
        {
            "id": "multid_hai.chunk_2",
            "title": "Exploring the Synergy of Human Creativity and Artificial Intelligence through Participatory Design",
            "content": "par- ticipatory design, a method of involving users in the design process, will be employed to obtain continuous feedback on design decisions. A first practical work in the form of a co-creative project with a state theater is planned and will be staged as a theater installation. This will be evaluated and the feedback will be utilized to improve the prototype. In a second round of implementation, another interactive, co-creative prototype for digitized photo products will be planned and executed. Please note that the possible realizations depend on the results of the previous analysis, due to which deviations may occur. 4 OUTCOMES This section demonstrates preliminary and possible future outcomes of this work. The results of the first FG are briefly summarized here. Please note that no other results can be reported at this time. The goal of the FG was to identify the CoU (cf. Section 3). With the help of five participants (1F, 4M) aged between 23 and 51 (Ø=33, SD=9.7) four topics were explored: (1) Creativity in peoples’ everyday life, (2) Situations when people are creative with others, (3) Familiarity with computer-based creative systems, and (4) Interactions with co-creative AI systems. All participants were non-experts regarding the use of co-creative systems, four of whom worked in 3157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208CHI’23, April 23–28, 2023, Hamburg, Germany Ani Withöft computer science (one was an interior architect). The FG was held in person and lasted two hours, with me as moderator, interactively guiding the participants through the FG. The discussions and feedback were evaluated using a thematic analysis (by [2]) that yielded three main themes, which are briefly described here. Versatile Human Creativity. Participants have felt personally creative and co-creative in a variety of areas: (A) \"Expressive Activities\", such as cooking, crafting, gift wrapping, or making music, which involve creating something new and unique, (B) \"Active Lifestyle\", such as walking, traveling, dancing, preferring mornings to evenings, quiet contemplation, each reflecting physical activity, personal preferences, and choices related to habits, and (C) \"Job-related Productivity\", such as collaborative programming, identify research potentials and new project ideas, organize events or workshops, and help clients develop design ideas, which are all about professional growth and advancement. Interest in Collaborative Human-AI Systems. All participants were interested and curious about co-creative systems. They could all envision the use of co-creative systems, mainly focusing on professional environments and, particularly, on reciprocal collaboration. One subject said: \"Clear, distinct feedback during interaction between human and AI systems is important [...]. The lack could have a negative impact on my creativity [...]\" (P4). Risks and Uncertainties of AI. Participants discussed the negative effects of AI on human creativity. They mentioned how relying too much on AI can lead to a loss of self-confidence in one’s own creativity (P1), hinder one’s own creativity (P3), and even replace and decompose human creativity (P5). A participant stated for instance \"AI systems could offer so many creative solutions so much faster and so much better, that the creatively thinking person would feel disengaged and say ’Oh well, I won’t bother at all then’ \" (P5). Another participant mentioned risks such as a negative \"stubborn\" AI and the potential for uncanniness (P2). It should be noted that the results presented here with N=5 are not generalizable and do not include all aspects relevant to the intended research. However, it demonstrates a first major step into the determination of the CoU. Based on these findings, the second FG will be conducted, which will provide further insights into the understanding and underlying dynamics of co-creative human-AI synergies. This work may yield guidelines that provide ethical approaches to this topic, as well as other interactive web applications that support co-creativity in the early stages of human creativity. Also, two co-creative prototypes (one in the field of theater) are planned to be developed and evaluated during this work. 5 CONCLUSION The goal of this research is to explore the mechanisms behind the synergetic relationship between human creativity and AI. Through a multidisciplinary approach, the objective is to gain insights into how co-creativity between humans and AI can function and how AI can complement, rather than replace, creative human approaches to address challenges in various domains. The focus group, conducted with human participants discussing co-creative AI systems, provided valuable insights into the potential of co-creativity between humans and AI and how it can be leveraged to foster positive human-AI collaboration. Although highlighting the potential benefits of human-AI co-creativity is crucial, it is also essential to acknowledge the respective challenges of such collaboration. The risks and uncertainties of AI models and the associated lack of feedback could cause user frustration and make the usage of such systems challenging. Overall, by providing insights into the mechanisms behind the synergistic relationship between human-AI creativity, this work plans to open up new avenues for future research and development in this area. The preliminary results of this paper show the potential of human-AI co-creativity systems for enhancing and augmenting creative approaches to various challenges, and point out the need for a responsible and ethical approach to human-AI collaboration. 4209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260Synergy of Human Creativity and Artificial Intelligence CHI’23, April 23–28, 2023, Hamburg, Germany REFERENCES [1] Nantheera Anantrasirichai and David Bull. 2022. Artificial intelligence in the creative industries: a review. Artificial Intelligence Review 55, 1 (Jan. 2022), 589–656. https://doi.org/10.1007/s10462-021-10039-7 [2]Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa [3] Nick Bryan-Kinns, Berker Banar, Corey Ford, Courtney N Reed, Yixiao Zhang, Simon Colton, and Jack Armitage. 2021. Exploring XAI for the Arts: Explaining Latent Space in Generative Music. In 1st Workshop on eXplainable AI approaches for debugging and diagnosis (XAI4Debugging) . Virtual, 15. [4]Daniel Buschek, Lukas Mecke, Florian Lehmann, and Hai Dang. 2021. Nine Potential Pitfalls when Designing Human-AI Co-Creative Systems. arXiv:2104.00358 [cs] (April 2021). http://arxiv.org/abs/2104.00358 [5]Eva Cetinic and James She. 2021. Understanding and Creating Art with AI: Review and Outlook. arXiv:2102.09109 [cs] (Feb. 2021). http: //arxiv.org/abs/2102.09109 [6] Neo Christopher Chung. 2021. Human in the Loop for Machine Creativity. arXiv:2110.03569 [cs] (Oct. 2021). http://arxiv.org/abs/2110.03569 [7] Nicholas Davis, Chih-Pin Hsiao, Yanna Popova, and Brian Magerko. 2015. An Enactive Model of Creativity for Computational Collaboration and Co-creation. In Creativity in the Digital Age , Nelson Zagalo and Pedro Branco (Eds.). Springer, London, 109–133. https://doi.org/10.1007/978-1- 4471-6681-8_7 [8] Imke Grabe, Miguel González-Duque, Sebastian Risi, and Jichen Zhu. 2022. Towards a Framework for Human-AI Interaction Patterns in Co-Creative GAN Applications. In Joint Proceedings of the ACM IUI Workshops 2022 . Helsinki, Finland, 1–11. [9] Dejan Grba. 2022. Deep Else: A Critical Framework for AI Art. Digital 2, 1 (Jan. 2022), 1–32. https://doi.org/10.3390/digital2010001 [10] Matthew Guzdial and Mark Riedl. 2019. An Interaction Framework for Studying Co-Creative AI. arXiv:1903.09709 [cs] (March 2019). http: //arxiv.org/abs/1903.09709 [11] Rowan T. Hughes, Liming Zhu, and Tomasz Bednarz. 2021. Generative Adversarial Networks–Enabled Human–Artificial Intelligence Collaborative Applications for Creative and Design Industries: A Systematic Review of Current Approaches and Trends. Frontiers in Artificial Intelligence 4 (April 2021), 604234. https://doi.org/10.3389/frai.2021.604234 [12] Angel Hsing-Chi Hwang. 2022. Too Late to be Creative? AI-Empowered Tools in Creative Processes. In CHI Conference on Human Factors in Computing Systems Extended Abstracts . ACM, New Orleans LA USA, 1–9. https://doi.org/10.1145/3491101.3503549 [13] ISO9241. 2019. Ergonomics of human-system interaction - Part 210: Human-centred design for interactive systems (ISO 9241-210:2019). [14] Pegah Karimi, Jeba Rezwana, Safat Siddiqui, Mary Lou Maher, and Nasrin Dehbozorgi. 2020. Creative sketching partner: an analysis of human-AI co-creativity. In Proceedings of the 25th International Conference on Intelligent User Interfaces . ACM, Cagliari Italy, 221–230. https://doi.org/10.1145/ 3377325.3377522 [15] Jingoog Kim, Mary Lou Maher, and Safat Siddiqui. 2021. Collaborative Ideation Partner: Design Ideation in Human-AI Co-creativity. In Proceedings of the 5th International Conference on Computer-Human Interaction Research and Applications . 123–130. https://doi.org/10.5220/0010640800003060 [16] Duri Long, Mikhail Jacob, and Brian Magerko. 2019. Designing Co-Creative AI for Public Spaces. In Proceedings of the 2019 on Creativity and Cognition . ACM, San Diego CA USA, 271–284. https://doi.org/10.1145/3325480.3325504 [17] Deborah Mateja and Armin Heinzl. 2021. Towards Machine Learning as an Enabler of Computational Creativity. IEEE Transactions on Artificial Intelligence 2, 6 (Dec. 2021), 460–475. https://doi.org/10.1109/TAI.2021.3100456 [18] Jon McCormack, Patrick Hutchings, Toby Gifford, Matthew Yee-King, Maria Teresa Llano, and Mark D’inverno. 2020. Design Considerations for Real-Time Collaboration with Creative Artificial Intelligence. Organised Sound 25, 1 (April 2020), 41–52. https://doi.org/10.1017/S1355771819000451 [19] Gianluca Micchi, Louis Bigo, Mathieu Giraud, Richard Groult, and Florence Levé. 2021. I Keep Counting: An Experiment in Human/AI Co-creative Songwriting. Transactions of the International Society for Music Information Retrieval 4, 1 (Dec. 2021), 263–275. https://doi.org/10.5334/tismir.93 [20] Michael Muller, Justin D Weisz, and Werner Geyer. 2020. Mixed Initiative Generative AI Interfaces: An Analytic Framework for Generative AI Applications. In Proceedings of the Workshop The Future of Co-Creative Systems-A Workshop on Human-Computer Co-Creativity of the 11th International Conference on Computational Creativity (ICCC 2020) . [21] Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I Lead, You Help but Only with Enough Details: Understanding User Experience of Co-Creation with Artificial Intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems . ACM, Montreal QC Canada, 1–13. https://doi.org/10.1145/3173574.3174223 [22] Jeba Rezwana and Mary Lou Maher. 2022. Designing Creative AI Partners with COFI: A Framework for Modeling Interaction in Human-AI Co-Creative Systems. ACM Transactions on Computer-Human Interaction (Feb. 2022). https://doi.org/10.1145/3519026 [23] Alessandro Saffiotti, Peter Fogel, Peter Knudsen, Luis de Miranda, and Oscar Thörn. 2020. On human-AI collaboration in artistic performance. In First International Workshop on New Foundations for Human-Centered AI (NeHuAI) co-located with 24th European Conference on Artificial Intelligence (ECAI 2020) . CEUR-WS, Santiago de Compostella, Spain, 38–43. http://urn.kb.se/resolve?urn=urn:nbn:se:his:diva-19098 [24] Dakuo Wang, Elizabeth Churchill, Pattie Maes, Xiangmin Fan, Ben Shneiderman, Yuanchun Shi, and Qianying Wang. 2020. From Human-Human Collaboration to Human-AI Collaboration: Designing AI Systems That Can Work Together with People. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20) . ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3334480.3381069 5261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312CHI’23, April 23–28, 2023, Hamburg, Germany Ani Withöft [25] Georgios N. Yannakakis, Antonios Liapis, and Constantine Alexopoulos. 2014. Mixed-initiative co-creativity. 9th International Conference on the Foundations of Digital Games, Fort Lauderdale (2014), 1–8. https://www.um.edu.mt/library/oar/handle/123456789/29459 [26] Joanna Zylinska. 2020. AI Art: Machine Visions and Warped Dreams . Open Humanities Press. https://library.oapen.org/handle/20.500.12657/40042 6",
            "summary": "This document describes a research project that explores the relationship between human creativity and AI, using participatory design to involve users in the design process. The project includes a co-creative theatre project, developing an interactive prototype for digitized photo products, and two focus groups to explore participants' familiarity with co-creative systems and their interest in collaborating with them. The results of the first focus group are presented, including participants' interest in collaborative human-AI systems, the risks and uncertainties of AI, and the versatility of human creativity. The project aims to open up new avenues for future research and development in this area, providing insights into co-creative human-AI synergies and yielding guidelines that provide ethical approaches to this topic.",
            "children": []
        }
    ]
}